{"projects":[{
    "name": "VigorGo",
    "date": "Mar. 2021",
    "tags": ["react","html","sass","vercel","hackathon"],
    "desc":"32h pour réaliser un projet! Voici le résultat du prototype, une application web présentent divers datas et permettant divers actions, comme la connection avec des profils similaires, une messagerie, un système de recommandations d'activitées, ect.. Un projet qui répond à une problématique posé par l'assurance Helsana, comment améliorer la santé des suisses, s'accompagne au protoypage toute une réfléxion autour du projet, une présentation du produit futur ainsi que du prototype.",
    "image": "vigorgo.png",
    "link": "https://vigorgo.pierreevl.com/register"
},
{
    "name":"Puissance 4 online",
    "date": "Jan. 2021",
    "tags": ["node","react","html","sass","heroku","personal hosting"],
    "desc":"L'objectif de ce projet était d’entraîner mes compétences en fullstack, c’est un puissance 4 en ligne et en temps réel. Il fonctionne grâce au web sockets via la librairie “socket.io”. Cette application web inclut différents types de parties: les parties classées et les parties privées. Chaque type de partie se rejoins différemment (et notamment un système de matchmaking). Il y a encore d’autres fonctionnalités tel que l’inscription/ connexion, les pages profils, les historiques de parties … Cette application web utilise node et react.",
    "image": "power4.png",
    "link": "https://puissance4.pierreevl.com"
},
{
    "name": "France Memes",
    "date": "Jan. 2021",
    "tags": ["next.js","react","html","sass","personal hosting"],
    "desc": "Intégration d’un design pour un site de présentation du plus gros serveur discord de “memes” francophone! Réalisé sous next.js, nous avons réussi à mettre en place un site optimisé SEO et extrêment bon en performance",
    "image": "fm.PNG",
    "link": "https://francememe.vercel.app"
},
{
    "name": "Blocky's game editor",
    "date": "Feb. 2021",
    "tags": ["vanilla js", "canvas api", "2d", "game", "personal hosting"],
    "desc": "Un petit jeu fait en javascript vanilla en exploitant l’api canvas. Un gameplay simple et efficace, des performances optimisées, pleins de niveaux, des collisions et même un éditeur de niveaux!",
    "image": "blocky.PNG",
    "link": "https://blocky.pierreevl.com"
},
{
    "name": "Insane transition library",
    "date": "Oct. 2020",
    "tags": ["js", "html", "css", "npm", "library", "personal hosting"],
    "desc": "Insane transition est une librairie de template d’animation simple et efficace. Prise en main en 1 min maximum. Les animations utilisent des propriétés css. Un site de présentation est une documentation on été ajouté autour de cette librairie.",
    "image": "insanet.PNG",
    "link": "https://insanetransition.pierreevl.com"
}
]}